Revit 2027 API
Rectangle.Top Property
 The y-coordinate of the top-left corner of the rectangle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Top { get; set; }
Public Property Top As Integer
	Get
	Set
public:
property int Top {
	int get ();
	void set (int value);
}
member Top : int with get, set
Property Value
Int32
See Also
Reference
Rectangle Class
Autodesk.Revit.DB Namespace